#### Terraform Plan 📖

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.metabase_table.screen_summary_table will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "screen_summary_table" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["cesn"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["co"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["co_tax_calculator"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["il"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["ma"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["nc"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # data.metabase_table.tenant_screen_summary_tables["tx"] will be read during apply
  # (config refers to values not yet known)
 <= data "metabase_table" "tenant_screen_summary_tables" {
      + db_id        = (known after apply)
      + description  = (known after apply)
      + display_name = (known after apply)
      + fields       = (known after apply)
      + name         = "mart_screener_data"
      + schema       = "analytics"
    }

  # metabase_card.screen_count will be created
  + resource "metabase_card" "screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["cesn"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["co"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["co_tax_calculator"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["il"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["ma"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["nc"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_card.tenant_screen_count["tx"] will be created
  + resource "metabase_card" "tenant_screen_count" {
      + id   = (known after apply)
      + json = (known after apply)
    }

  # metabase_collection.global will be created
  + resource "metabase_collection" "global" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "Global"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_cesn will be created
  + resource "metabase_collection" "tenant_collection_cesn" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "CESN"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_co will be created
  + resource "metabase_collection" "tenant_collection_co" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "Colorado"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_co_tax_calculator will be created
  + resource "metabase_collection" "tenant_collection_co_tax_calculator" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "CO Tax Calculator"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_il will be created
  + resource "metabase_collection" "tenant_collection_il" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "Illinois"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_ma will be created
  + resource "metabase_collection" "tenant_collection_ma" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "Massachusetts"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_nc will be created
  + resource "metabase_collection" "tenant_collection_nc" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "North Carolina"
      + slug      = (known after apply)
    }

  # metabase_collection.tenant_collection_tx will be created
  + resource "metabase_collection" "tenant_collection_tx" {
      + entity_id = (known after apply)
      + id        = (known after apply)
      + location  = (known after apply)
      + name      = "Texas"
      + slug      = (known after apply)
    }

  # metabase_dashboard.analytics will be created
  + resource "metabase_dashboard" "analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "MFB Analytics Dashboard"
    }

  # metabase_dashboard.tenant_analytics["cesn"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "CESN Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["co"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "Colorado Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["co_tax_calculator"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "CO Tax Calculator Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["il"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "Illinois Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["ma"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "Massachusetts Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["nc"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "North Carolina Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_dashboard.tenant_analytics["tx"] will be created
  + resource "metabase_dashboard" "tenant_analytics" {
      + cards_json    = (known after apply)
      + collection_id = (known after apply)
      + id            = (known after apply)
      + name          = "Texas Dashboard"
      + tabs_json     = jsonencode(
            [
              + {
                  + id   = 1
                  + name = "Google Analytics"
                },
              + {
                  + id   = 2
                  + name = "All-Time Performance"
                },
              + {
                  + id   = 3
                  + name = "Last 30 Days Performance"
                },
              + {
                  + id   = 4
                  + name = "Households"
                },
              + {
                  + id   = 5
                  + name = "Benefits & Immediate Needs"
                },
            ]
        )
    }

  # metabase_database.postgres will be created
  + resource "metabase_database" "postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL Analytics"
    }

  # metabase_database.tenant_postgres["cesn"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL CESN"
    }

  # metabase_database.tenant_postgres["co"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL Colorado"
    }

  # metabase_database.tenant_postgres["co_tax_calculator"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL CO Tax Calculator"
    }

  # metabase_database.tenant_postgres["il"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL Illinois"
    }

  # metabase_database.tenant_postgres["ma"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL Massachusetts"
    }

  # metabase_database.tenant_postgres["nc"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL North Carolina"
    }

  # metabase_database.tenant_postgres["tx"] will be created
  + resource "metabase_database" "tenant_postgres" {
      + custom_details = {
          + details_json        = (sensitive value)
          + engine              = "postgres"
          + redacted_attributes = [
              + "password",
            ]
        }
      + id             = (known after apply)
      + name           = "MFB PostgreSQL Texas"
    }

  # time_sleep.wait_for_database_sync will be created
  + resource "time_sleep" "wait_for_database_sync" {
      + create_duration = "60s"
      + id              = (known after apply)
    }

Plan: 33 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + main_dashboard_url    = (known after apply)
  + tenant_dashboard_urls = {
      + cesn              = (known after apply)
      + co                = (known after apply)
      + co_tax_calculator = (known after apply)
      + il                = (known after apply)
      + ma                = (known after apply)
      + nc                = (known after apply)
      + tx                = (known after apply)
    }

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"

```

</details>

*Pusher: @jmejia, Action: `pull_request`, Environment: `staging`*